tylertms/kinetis-k22-sim/tests/architecture/cortex_m4/system/trace_test.c
#include "kinetis.h"

#include <stdint.h>

#include "test.h"

typedef struct {
    uint32_t addresses[8];
    uint32_t opcodes[8];
    bool executed[8];
    uint8_t count;
} TraceState;

static void capture_trace(void* context, uint32_t address, uint32_t opcode, bool executed) {
    TraceState* trace = context;
    if (trace->count < 8) {
        trace->addresses[trace->count] = address;
        trace->opcodes[trace->count] = opcode;
        trace->executed[trace->count] = executed;
        trace->count++;
    }
}

int main(void) {
    TestState state = {0};
    KinetisConfiguration configuration = kinetis_configuration(KINETIS_PROFILE_MK22FN51212);
    configuration.flash_size = 4096;
    configuration.sram_size = 4096;
    Kinetis* device = kinetis_create(configuration);
    expect(&state, device != NULL, "device != NULL");

    const uint32_t vectors[2] = {0x20000100u, 0x00000101u};
    const uint16_t program[] = {0x2000u, 0x2801u, 0xbf08u, 0x3001u, 0xf240u, 0x0102u, 0xbe00u};
    expect(&state, kinetis_load(device, 0, vectors, sizeof(vectors)),
           "kinetis_load(device, 0, vectors, sizeof(vectors))");
    expect(&state, kinetis_load(device, 0x100, program, sizeof(program)),
           "kinetis_load(device, 0x100, program, sizeof(program))");
    expect(&state, kinetis_reset(device), "kinetis_reset(device)");
    test_connect_debugger(&state, kinetis_cpu(device));

    TraceState trace = {0};
    cortex_m4_set_trace(kinetis_cpu(device), capture_trace, &trace);
    const CortexM4Result result = cortex_m4_run(kinetis_cpu(device), (CortexM4RunLimits){16, 32});
    expect(&state, result.stop == CORTEX_M4_STOP_BREAKPOINT,
           "result.stop == CORTEX_M4_STOP_BREAKPOINT");
    expect(&state, trace.count == 6, "trace.count == 6");
    expect(&state, trace.addresses[0] == 0x100u, "trace.addresses[0] == 0x100u");
    expect(&state, trace.addresses[3] == 0x106u, "trace.addresses[3] == 0x106u");
    expect(&state, trace.addresses[4] == 0x108u, "trace.addresses[4] == 0x108u");
    expect(&state, trace.opcodes[4] == 0xf2400102u, "trace.opcodes[4] == 0xf2400102u");
    expect(&state, !trace.executed[3], "!trace.executed[3]");
    expect(&state, trace.executed[4], "trace.executed[4]");
    expect(&state, cortex_m4_get_register(kinetis_cpu(device), 0) == 0,
           "cortex_m4_get_register(kinetis_cpu(device), 0) == 0");
    expect(&state, cortex_m4_get_register(kinetis_cpu(device), 1) == 2,
           "cortex_m4_get_register(kinetis_cpu(device), 1) == 2");

    cortex_m4_set_trace(kinetis_cpu(device), NULL, NULL);
    expect(&state, kinetis_reset(device), "kinetis_reset(device)");
    expect(&state, trace.count == 6, "trace.count == 6");

    CortexM4Coverage* coverage = cortex_m4_coverage_create(0x100u, 16u);
    expect(&state, coverage != NULL, "coverage != NULL");
    cortex_m4_set_trace(kinetis_cpu(device), cortex_m4_coverage_record, coverage);
    expect(&state, kinetis_reset(device), "coverage reset succeeds");
    test_connect_debugger(&state, kinetis_cpu(device));
    const CortexM4Result coverage_run =
        cortex_m4_run(kinetis_cpu(device), (CortexM4RunLimits){16, 32});
    expect(&state, coverage_run.stop == CORTEX_M4_STOP_BREAKPOINT,
           "coverage run reaches the breakpoint");
    CortexM4CoverageResult coverage_result = cortex_m4_coverage_result(coverage);
    expect(&state, coverage_result.instructions == 5u, "coverage records executed instructions");
    expect(&state, coverage_result.skipped == 1u, "coverage records skipped instructions");
    expect(&state, coverage_result.outside_range == 0u, "coverage stays inside its range");
    expect(&state, coverage_result.unique_instructions == 5u,
           "coverage counts unique instructions");
    expect(&state, coverage_result.unique_skipped == 1u, "coverage counts unique skips");
    expect(&state, cortex_m4_coverage_flags(coverage, 0x100u) == CORTEX_M4_COVERAGE_EXECUTED,
           "coverage exposes executed instructions");
    expect(&state, cortex_m4_coverage_flags(coverage, 0x106u) == CORTEX_M4_COVERAGE_SKIPPED,
           "coverage exposes skipped instructions");
    expect(&state, cortex_m4_coverage_flags(coverage, 0x10cu) == CORTEX_M4_COVERAGE_EXECUTED,
           "coverage exposes the final instruction");
    cortex_m4_coverage_clear(coverage);
    coverage_result = cortex_m4_coverage_result(coverage);
    expect(&state, coverage_result.instructions == 0u, "coverage clear resets counters");
    expect(&state, cortex_m4_coverage_flags(coverage, 0x100u) == 0u, "coverage clear resets slots");
    cortex_m4_coverage_destroy(coverage);
    expect(&state, cortex_m4_coverage_create(1u, 2u) == NULL, "coverage rejects odd addresses");
    expect(&state, cortex_m4_coverage_create(0u, 1u) == NULL, "coverage rejects odd sizes");
    expect(&state, cortex_m4_coverage_create(UINT32_MAX - 1u, 4u) == NULL,
           "coverage rejects overflowing ranges");
    cortex_m4_coverage_clear(NULL);
    cortex_m4_coverage_record(NULL, 0u, 0u, true);
    cortex_m4_coverage_destroy(NULL);

    kinetis_destroy(device);
    return test_finish(&state);
}
